trunk/data/WLM Data/Full Login/sharing service.xml

https://by6.omega.contacts.msn.com/abservice/SharingService.asmx


POST /abservice/SharingService.asmx HTTP/1.1
Accept: text/*
SOAPAction: http://www.msn.com/webservices/AddressBook/FindMembership
Content-Type: text/xml; charset=utf-8
User-Agent: MSN Explorer/9.0 (MSN 8.0; TmstmpExt)
Host: by6.omega.contacts.msn.com
Content-Length: 1945
Connection: Keep-Alive
Cache-Control: no-cache

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Header>
    <ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ApplicationId>996CDE1E-AA53-4477-B943-2BE802EA6166</ApplicationId>
      <IsMigration>false</IsMigration>
      <PartnerScenario>Initial</PartnerScenario>
      <CacheKey>12r3:oor7v1zvsCWKJuVkuHVD/V55/HcIjzfc4Z5yujljk7X2iRmabuQZYoRj05nUyeUKxPMHJQe1OXEU7U/edeCmIcjQJ37EZJ/JyZkPbybDES3l68dsD4hWc5jGU6Xi9yd2dbPusrpDvDG0FOD3LYKUlYdQf4xs3Txlo4btPDbIUr4=</CacheKey>
    </ABApplicationHeader>
    <ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ManagedGroupRequest>false</ManagedGroupRequest>
      <TicketToken>t=EwDIAcBdAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AACew9ABFVGaeqeAlfNvbF6YT/OdKwLUyxGarq/yhjJPpF4tA276y46WLReFrChN6/CEU31akhJ1tAuM2Fni9XEaMGVVA7jlW1dmDVMa3bMikxS+nsUoY4vYCsSgnbMxDIMeuLmDsm/zV5frFKVU+ysItr+5XDBAv6vJDx0eysW9CA2YAAAhiV61UfqJ2SBgBQ+RoEReNgU+pvGoPtjraJlXQMfhsELqueLs598z1V2PEZUUB88Vtkbb6dIRgM4c16IlrNm8RQkd8iz5i8EmCrn/7FCEscbp84v2X+6a4sqd29f7PWd54ZztxHhAJPIuJ6ZtciEp0U3lu20jW9JCq4LH6ydxGD1Hyo0FHk8kLWEjvDylQCmcLIIHDFHOQOsYa7LtsSytMen5pG3EpQCxDjmyBtjyFz7PIHm3ZOApetTjCLAVSb5LrNjadGlyWzJdwPQP7uR6tg2GoqrYzbgMkMwp0gudoCSAagAyM6QhmGy3Agwfd2yKJW/K7O/CRbqF0GaVunIS4laI1aT/M82NP2atntRL8m6+3kqupjMyTvb2oOG12sf7tSTAB&amp;p=</TicketToken>
    </ABAuthHeader>
  </soap:Header>
  <soap:Body>
    <FindMembership xmlns="http://www.msn.com/webservices/AddressBook">
      <serviceFilter>
        <Types>
          <ServiceType>Messenger</ServiceType>
          <ServiceType>Invitation</ServiceType>
          <ServiceType>SocialNetwork</ServiceType>
          <ServiceType>Space</ServiceType>
          <ServiceType>Profile</ServiceType>
        </Types>
      </serviceFilter>
      <View>Full</View>
      <deltasOnly>true</deltasOnly>
      <lastChange>2007-05-19T10:15:19.353-07:00</lastChange>
    </FindMembership>
  </soap:Body>
</soap:Envelope>

=========================================
HTTP/1.1 200 OK
Date: Thu, 07 Jun 2007 17:45:02 GMT
Server: Microsoft-IIS/6.0
P3P:CP="BUS CUR CONo FIN IVDo ONL OUR PHY SAMo TELo"
X-Powered-By: ASP.NET
X-MSNSERVER: BY2ABCHWB5
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 573

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <ServiceHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <Version>
        12.03.1527.0001
      </Version>
      <CacheKeyChanged>false</CacheKeyChanged>
      <PreferredHostName>by6.omega.contacts.msn.com</PreferredHostName>
    </ServiceHeader>
  </soap:Header>
  <soap:Body>
    <FindMembershipResponse xmlns="http://www.msn.com/webservices/AddressBook" />
  </soap:Body>
</soap:Envelope>